In [2]:
import pandas as pd

In [6]:
# create sample csv
import csv

data = [
    ['col1', 'col2', 'col3'],
    ['test1', '13', ''],
    ['test2', '44', 'aaa'],
    ['test3', '', ''],
    ['', '', ''],
    ['test5', '', 'bbb'],
    ['', '', '']
]

filename = 'data_with_nan.csv'

with open(filename, 'w', newline='') as csvfile:
    csvwriter = csv.writer(csvfile)
    csvwriter.writerows(data)

In [7]:
file_path = '/workspaces/demo-devcontainer-main/src/test/data_with_nan.csv'

df = pd.read_csv(file_path)

df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [8]:
df['col2'].mean()

np.float64(28.5)

In [9]:
# drop row with any value is null
df.dropna()

    col1  col2 col3
1  test2  44.0  aaa

In [11]:
# drop row with all value is null
df.dropna(how='all')

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [12]:
# drop row with value contain with 2 null
df.dropna(thresh=2)

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
4  test5   NaN  bbb

In [13]:
# replace NA with 0
df['col2'].fillna(0)

0    13.0
1    44.0
2     0.0
3     0.0
4     0.0
5     0.0
Name: col2, dtype: float64